Tekla Open API Reference for Tekla Structures 2025
DistanceList.Clear Method
 Clears the list.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
Examples
 This example shows how to remove all items from a DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance[] distances = { new Distance(30.2), new Distance(2.3) };
           DistanceList distanceList = new DistanceList(distances);
           // The whole list can be cleared with DistanceList.Clear method.
           distanceList.Clear();
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace